Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: После создания пакета пользователь увидит Область построения сценария (6) и панель Компоненты (5), содержащую стандартные компоненты, предоставляемые платформой (см.
en: Upon package creation, a user will see the Workflow Construction Area (6) and the Components panel (5) which contains the standard components provided by the platform (refer to

source: После создания пользователя, его имя изменить нельзя.| |Полное имя|Полное имя пользователя, поле не обязательно к заполнению| |Аутентификация|Выбор способа Аутентификации пользователя: Локальная или LDAP| |Пароль|Пароль пользователя используемый для входа в систему, в таблице раздела Пользователи данный столбец отсутствует| |Администрирование|Указывает является ли пользователем администратором, открывает доступ к разделу Администрирование и его подразделам| |Проектирование сценариев|Указывает является ли пользователь аналитиком, открывает доступ к проектированию сценариев| |Просмотр отчетов|Открывает доступ к разделу Отчеты.
en: Upon creation of the user, it is not possible to change his name.| |Full name|Full user name, it is not obligatory to fill in this field.| |Authentification|Selection of method of Authentification of user: Local or LDAP| |Password|The user password used for login, this column is not available in the table of the Users section| |Administration|It displays whether the user is an administrator, makes Administration section and its subsections accessible| |Workflows design|It displays whether the user is an analyst, makes workflows design accessible| |View reports|It makes Reports section accessible.

source: После создания, заданные значения полей для дочернего узла можно поменять.
en: Upon creation, it is possible to change the set values of fields for the child node.

source: После сохранения будет приведено к имени файла и правильному идентификатору.
en: It will be set to the file name and correct identifier after saving.

source: После сохранения настроек Производный компонент будет доступен в панели Производные компоненты.
en: Upon saving the settings, the Derived Component will be available on Derived components panel.

source: После такого выбора программа автоматически выполняет сценарий, соответствующий этому отчету, и выдает результат в зависимости от настроенного отображения отчета.
en: Upon such choice, the program will automatically execute the workflow compliant with this report and provide the result according to the configured report display.

source: После того как будет создана вся необходимая иерархия можно будет воспользоваться кнопкой Связать все автоматическиСвязать все автоматически, которая автоматически свяжет входные и выходные поля, если у них совпадают имена и тип данных.
en: When all required hierarchy is created, it will be possible to use Auto link allAuto link all button that will automatically link input and output fields if their names and data type coincide.

source: После того, как необходимые для публикации узлы сценария настроены, необходимо произвести публикацию пакета.
en: When workflow nodes are set as the nodes required for publication, it is necessary to publish the package.

source: После того, как требуемые параметры будут заданы, подключение может быть протестировано.
en: When all required parameters are set, the connection can be tested.

source: После установки настроек фильтрации нужно нажать кнопку Фильтровать.
en: After filtering setup, it is required to press Filter button.

source: После установки системы в обязательном порядке необходимо заменить пароль этого пользователя.
en: It is obligatory to change the password of this user after the system setup.

source: После установления связи кнопка перестает быть активной, а название меняется на Активировано.
en: Upon connection establishment, the button is inactive, and the name is changed to Activated.

source: После этого будет создан дочерний узел, для которого можно определить значение следующих полей:
en: Afterwards the child node will be created. It is possible to define value of the following fields for this node:

source: После этого разница распределяется между всеми разгруппированными значениями в соответствии с выбранным методом балансировки.
en: Then the difference is distributed between all ungrouped values according to the selected balance method.

source: Последнее в списке.
en: Last listed.

source: Последнее в списке;
en: Last listed.

source: Последнему локальному администратору нельзя изменять способ Аутентификации.
en: The last local administrator cannot change the Authentification method.

source: Последние два параметра можно не указывать.
en: Not stating the last two parameters is permitted.

source: Последовательно выполняются следующие этапы настройки:
en: The following configuration stages are successively executed:

source: Последовательно подключим их к узлу соединения, и на выходе получим такой список переменных (столбец "Примечание" приведен для наглядности, в результирующий набор он включен не будет):
en: It is required to provide serial connection to the node. We will receive the following list of variables at the output (the "Note" column is provided for clarity; it won't be included into the resulting set):

source: Последовательное нажатие на заголовок меняет порядок сортировки или отменяет его.
en: Subsequent pressing the header enables to change the sorting order or cancels it.

source: Последовательность выполнения
en: Order of Execution

source: Последовательность действий алгоритма замены:
en: Sequence of the replacement algorithm actions:

source: Последовательность обработки данных задается соединением выходного порта узла импорта с входным портом группировки (см.
en: The sequence of data processing is set by connection of the output port of the import node with the input grouping port (refer to

source: Последовательность обработки задается соединением выхода предыдущего узла сценария с входом последующего.
en: The processing sequence is determined by connection of the previous workflow node output and input of the subsequent one.

source: Последовательность обработки задается соединением выхода предыдущего узла сценария со входом последующего.
en: The processing sequence is determined by connection of the previous workflow node output and input of the subsequent one.

source: Последовательность строк в выборке будет такой же, как и в исходной таблице.
en: Sequence of the sample rows will be the same as in the source table.

source: Последовательный - соотношение данных для тестового и обучающего множеств задается вручную.
en: Consequent: data ratio for the test and training sets is customized.

source: Последовательный — группы строк множеств (обучающее, неиспользуемое, тестовое) выбираются последовательно, т.е. сначала выбираются те записи, которые входят в первое множество, затем — во второе и т.д.
en: Sequence: groups of sets rows (training, unused, test) are selected in a sequential order, namely, only the records that are included into the first set are selected first, then it is required to select the records that are included into the second set, etc.

source: Последующие символы имени могут быть такими же, либо цифрами.
en: Succeeding name characters can be the same, or they can be digits.

source: Поэтому для любых монотонных последовательностей коэффициент Спирмена будет равен -1 или 1.
en: Therefore, the Spearman coefficient will be 1 or -1 for any monotone sequences.

source: Поэтому они содержат большую часть информации, заключенной в первоначальных данных.
en: That's why they contain the most part of the information included into the source data.

source: Поэтому эти файлы не могут быть импортированы в Deductor 5.3 и ниже.
en: That's why these files cannot be imported to Deductor 5.3 and earlier.

source: Права на эту операцию задаются в Администрировании.
en: Rights to this operation are defined in Administration.

source: Правила замены вида: 1) 5 => -5; 2) 15 => -15.
en: There are the following replacement types: 1) 5 => -5; 2) 15 => -15.

source: Предварительная обработка данных для их дальнейшего использования в алгоритмах Data Mining.
en: Data preprocessing for its further use in the Data Mining algorithms.

source: Предварительное квантование — задает начальное число интервалов квантования входного признака (начальные классы) из которых, в соответствии с настроенными параметрами, будут сформированы конечные классы.
en: Prequanting sets the initial quantizing bin count of the input indicator (fine classes) from which the coarse classes will be generated according to the set parameters.

source: Предел
en: Bound

source: Предназначен для экспорта набора данных в текстовый файл.
en: It is designated for export of the data set to the text file.

source: Предназначена для внесения ручной корректировки в границы (или множества) сформированных конечных классов с целью достижения лучших результатов.
en: It is designated for the manual correction of bounds (or sets) of the generated coarse classes to achieve the best results.

source: Предоставляет список численных полей, содержащихся во входной таблице.
en: It provides a list of the numerical fields included into the input table.

source: Предоставляется выбор из следующих вариантов.
en: The following options are available:

source: Предоставляется выбор из следующих вариантов:
en: The following options are available:

source: Предоставляется выбор одного из вариантов:
en: It is required to select one of the options listed below:

source: Предпринимается попытка восстановить ранее настроенные связи с входными полями/переменными ("пропавшие", "некорректные" связи, появившееся в результате изменения структуры входных данных).
en: There is an attempt to restore previously configured links with the input fields/variables ("missing", "incorred" links that appeared due to the input data structure change).

source: Предпринимается попытка связать по признаку "совпадает тип данных и совпадает имя (без учета регистра)" входные и выходные поля/переменные, у которых нет связи.
en: There is an attempt to establish a link between the input and output fields/variables that do not have link by "data type matches and name matches (case-insensitive)" parameter.

source: Представление значений:
en: Literals:

source: Представляет виды данных.
en: It represents data kinds.

source: Представляет назначение полей.
en: It represents usage type of fields.

source: Представляет типы данных.
en: It represents data types.

source: Представляет ограниченное количество данных (не более 100 первых строк возможного результирующего набора) для ознакомления в виде плоской двумерной таблицы.
en: It provides the limited amount of data (not more than 100 first rows of possible resulting data set) for information purposes in the form of the flat two-dimensional table.

source: Представляет ограниченное количество данных для ознакомления в виде плоской двумерной таблицы.
en: It provides the limited amount of data for information purposes in the form of the flat two-dimensional table.

source: Представляет собой вероятность того, что значение проверочной статистики используемого критерия, вычисленное по выборке, превысит установленное p-значение.
en: It is probability of the fact that the test statistics value of the used criterion calculated for a sample will exceed the set P-value.

source: Представляет собой набор данных в иерархической древовидной структуре.
en: It is a set of data in the form of hierarchic tree-like structure.

source: Представляет собой редактор с шагом изменения значения 0,000001.
en: It is an editor with value change interval equal to 0.000001.

source: Представляет собой редактор с шагом изменения значения 0,1.
en: It is an editor with value change interval equal to 0.1.

source: Представляет собой структурированный набор данных, где все данные упорядочены в двумерную структуру, состоящую из столбцов и строк.
en: It is a structured set of data that are organised in the form of two-dimensional structure consisting of columns and rows.

source: Представляют собой объекты, содержащие только одно значение.
en: They are objects containing only one value.

source: Преимущество ручного переобучения состоит в возможности контроля параметров переобучения Модели и просмотра полученных результатов.
en: Advantage of the manual retraining is that control of the Model retraining parameters and view of the received results are possible.

source: Преобразование непрерывных и дискретных входных полей, используемых для построения моделей бинарной классификации, путем квантования на основе метода совокупности доказательств или WoE-анализа (weights of evidence, WoE).
en: Conversion of the continuous and discrete input fields used for training of the models related to the binary classification by means of the binning based on totality-of-evidence approach or WoE analysis (weights of evidence, WoE).

source: Преобразовать к требуемому виду (с полями Транзакция и Элемент) обычный набор данных, состоящий из столбцов с измеренными свойствами объектов всегда можно при помощи узлов-обработчиков Loginom, таких как Свёртка столбцов и Калькулятор.
en: It is always possible to convert the standard data set that consists of columns with measured object properties to the required kind (with the "Transaction" and "Item" fields) using such Loginom handling nodes as Unpivoting and Calculator.

source: Преобразуем исходную таблицу со следующими параметрами: колонки - Товар, строки - Дата, факты - Количество продаж.
en: Let's transform the source table with the following parameters: columns - Goods, strings - Date, measures - Volume of sales.

source: Преобразует заданную строку в число с учетом локали
en: Converts the given string into a number, taking locale into account

source: При экспорте данных в новую таблицу создается таблица движка Log.
en: When exporting data to the new table, the Log engine table is created.

source: При POST-запросах поля входной таблицы связываются с предопределенным параметром request, принимающим тело HTTP-запроса.
en: In the case of POST requests, the input table fields are linked to the predefined request parameter that accepts the HTTP request body.

source: При автоматическом определении числа кластеров:
en: In the case of auto selection of the cluster count:

source: При активном флаге.
en: When the checkbox is active.

source: При вводе вручную таблицы замены доступны ряд действий через панель инструментов области:
en: When entering the replacement table manually, the following actions are available by means of the area toolbar:

source: При вводе таблицы замены доступен ряд действий через панель инструментов области:
en: When entering the replacement table, the following actions are available by means of the area toolbar:

source: При включенной фильтрации Включенная фильтрация доступны совместимые поля, которые еще не связаны с ключевыми полями главной таблицы, при отключенной фильтрации Выключенная фильтрация можно выбрать любое из полей, совместимых по типу.
en: Activated Enabled filter option makes available compatible fields that are not still connected with key fields of the main table, deactivated Disabled filter option enables to select any of the fields compatible by type.

source: При внесении изменений в базовый узел во всех отнаследованных от него производных узлах появится оповещение "Базовый узел изменился...".
en: When introducing changes into the base node in all derived nodes inherited from it, the following notification will appear: "Base node was changed...".

source: При внутреннем соединении (SQL-аналог: INNER JOIN) происходит соединение двух таблиц.
en: Two tables are joined in the case of the inner join (SQL analogue: INNER JOIN).

source: При выборе данного раздела открывается окно со списком Производных компонентов, в котором доступны следующие действия:
en: When selecting this section, the window with the list of the Derived Components in which the following actions are available will be opened:

source: При выборе данной опции блок Параметры сети становится неактивным.
en: When selecting this option, Network Parameters pack becomes inactive.

source: При выборе метода открывается поле его параметров.
en: When selecting a method, the field with its parameters is opened.

source: При выборе нескольких вариантов функций, каждая из них будет рассчитана в отдельном столбце.
en: When selecting several function options, each of them will be calculated in a separate column.

source: При выборе процесса на информационной панели можно вызвать контекстное меню, содержащее следующие действия:
en: Selecting the process on the information panel, it is possible to call the context menu containing the following actions:

source: При выборе пункта На пропущенное, все значения не попавшие в Таблицу замен будут заменены на пустое значение <null>.
en: When With empty option is selected, all values not included into the Replacement table will be replaced with the null value <null>.

source: При выборе типа данных Тип данных строка в выпадающем списке справа от Выбор можно выбрать формат представления даты в строковом виде, а также задать Свой формат при помощи строки форматирования.
en: When selecting Data type type of data, the string in the drop-down list to the right of Choice enables to select the date representation format in the string form, and it is also possible to set Own format using formatting strings.

source: При выборе узла выбираются так же и его родители, вплоть до корня.
en: When selecting a node, its parents are also selected, up to its root.

source: При выборе узла для него формируется колонка с именем узла массива с добавлением "_global_index" и меткой узла массива с добавлением "|Глобальный индекс".
en: When selecting the node, a column with the array node name with "_global_index" added and the array node caption with "|Global index" added is generated for it.

source: При выделение порта появляется пунктирная линия с началом в исходном порту и концом в позиции курсора мыши, на его конце для удобства отображается тип порта с которым можно связать исходный порт (см.
en: When selecting the port, пунктирная линия appears. It starts in the source port and ends in the mouse cursor position. The type of the port with which it is required to link the source port is displayed on its end for convenience (refer to

source: При вызове окна Предпросмотра или выполнении узла выводится сообщение об обнаруженных синтаксических ошибках и ошибках хода выполнения с указанием позиции кода, содержащего ошибку.
en: When calling the Preview window or executing the node, the message informing about detected syntactic and execution errors is shown specifying position of the code with an error.

source: При выполнении команд Добавить дочерний узел, Добавить соседний узел, Редактировать... задаются значения полей:
en: When running the following commands: Add child node, Add neighboring node, Edit..., the following fields values are set:

source: При выполнении узла базовый узел не выполняется.
en: When executing the node, the base node is not executed.

source: При выполнении узла сообщения консоли записываются в лог сервера, если тип сообщения соответствует уровню логирования (ошибка, предупреждение, информация):
en: When running the node, the console messages are recorded to the server log, if the message type matches the logging level (error, warning, information):

source: При выставлении флага в чекбоксе поля выделяет все элементы в текущей директории.
en: When selecting the field checkbox, all items in the current directory are selected.

source: При выявлении ветви со значением "истина" проверка останавливается, ветвь становится активной, а остальные блокируются, даже если ниже по списку остались истинные;
en: When detecting the branch with the "true" value, testing is stopped, the branch becomes active, and other branches are locked, even if there are true branches down the list.

source: При данном способе слияния объем результирующей выборки может очень быстро расти.
en: When selecting this join method, the resulting sample volume can get higher very rapidly.

source: При двойном щелчке по линии разделителю или одинарном по середине линии, область будет скрыта.
en: The area will be hidden by double clicking on the separator line or single clicking on the middle part of the line.

source: При добавлении и редактировании выражения отображается диалог редактирования параметров.
en: When adding and editing expressions, the dialog of parameters editing is displayed.

source: При добавлении поля в список Выбранные поля функция агрегации будет назначена по-умолчанию:
en: When adding fields to the Selected fields list, the aggregation function will be assigned by default:

source: При задании настроек оси X можно также воспользоваться кнопками в списке полей (справа от названия поля):
en: When configuring the X axis settings, it is also possible to use the buttons in the fields list (to the right from the field name):

source: При задании оси Y происходит настройка добавления серии, а именно:
en: When setting the Y axis, the series addition is configured, namely:

source: При задании пользовательского формата используются следующие наборы символов форматирования:
en: When setting the user format, the following sets of formatting characters are used:

source: При задании пользовательского формата можно использовать сочетание произвольного текста и предопределенных маркеров.
en: When setting the user format, it is possible to use a combination of user-defined text and pre-defined markers.

source: При заданном числе кластеров:
en: In the case of the set number of clusters:

source: При закрытии Пакета с несохраненными изменениями будет предложено сохранить его с вариантами:
en: When closing the Package with unsaved changes, you will be requested to save it with the following variants:

source: При заполнении этих параметров можно воспользоваться предлагаемыми в списке вариантами форматов, либо задать пользовательский формат.
en: When filling in these parameters, it is possible to use the listed format options, or to set the user format.

source: При значении 0 все рекурсивные узлы не будут раскрыты автоматически
en: In the case of 0 value, recursive nodes won't be automatically opened.

source: При значении 0 все рекурсивные узлы не будут раскрыты автоматически.
en: In the case of 0 value recursive nodes won't be automatically opened.

source: При значении < 1 старые файлы логов не сохраняются.|
en: When value < 1, old log files are not saved.|

source: При значении true при каждом запуске лог-файл будет перезаписывать старый.| |Максимальный размер файла|10484760|Максимальный размер лог-файла, задается в байтах.
en: If the value is true, the log file will rewrite the old one at each start.| |Maximum file size|10484760|The maximum size of the log file is set in bytes.

source: При значении параметра, равном 1, алгоритм формирует классы таким образом, чтобы в каждый из них попало примерно одинаковое число наблюдений.
en: When the parameter value is equal to 1, the algorithm generates classes in such a way to include roughly the same number of observations into each of them.

source: При изменении значений исходного набора данных вся структура результирующей таблицы полностью перестроится с учетом новых значений.
en: When changing the source data set values, the whole structure of the resulting table will be fully reconstructed taking into account the new values.

source: При изменении значений исходного набора данных вся структура результирующей таблицы полностью перестроится с учетом новых уникальных значений.
en: When changing the source data set values, the whole structure of the resulting table will be fully reconstructed taking into account the new unique values.
